; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p2-5 - location
	p2-6 - location
	p3-1 - location
	p3-4 - location
	p3-5 - location
	p3-7 - location
	p5-0 - location
	p5-1 - location
	p6-1 - location
	p7-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s7)
	(at driver4 s4)
	(at driver5 s7)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at package1 s3)
	(at package2 s4)
	(at package3 s4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(link s0 s2)
	(link s2 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s4)
	(link s4 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s6)
	(link s6 s3)
	(link s3 s7)
	(link s7 s3)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s6)
	(link s6 s5)
	(link s6 s4)
	(link s4 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s5)
	(link s5 s7)
)
	(:goal (and
	(at driver3 s3)
	(at driver5 s5)
	(at truck2 s7)
	(at truck3 s6)
	(at truck4 s7)
	(at truck5 s3)
	(at package1 s6)
	(at package2 s3)
	(at package3 s3)
	))


)

; plan
1. (board-truck driver4 s4 truck3)
   deleted: (at driver4 s4) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 0 of 9
2. (load-truck s4 package3 truck3)
   deleted: (at package3 s4)
   added: (in package3 truck3)
   goals met: 0 of 9
3. (drive-truck driver4 s4 s3 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   goals met: 0 of 9
4. (unload-truck s3 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s3)
   goals met: 1 of 9
5. (load-truck s3 package1 truck3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   goals met: 1 of 9
6. (walk driver3 s7 p3-7)
   deleted: (at driver3 s7)
   added: (at driver3 p3-7)
   goals met: 1 of 9
7. (drive-truck driver4 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 1 of 9
8. (load-truck s4 package2 truck3)
   deleted: (at package2 s4)
   added: (in package2 truck3)
   goals met: 1 of 9
9. (drive-truck driver4 s4 s6 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   goals met: 2 of 9
10. (walk driver1 s2 p2-4)
   deleted: (at driver1 s2)
   added: (at driver1 p2-4)
   goals met: 2 of 9
11. (walk driver1 p2-4 s4)
   deleted: (at driver1 p2-4)
   added: (at driver1 s4)
   goals met: 2 of 9
12. (board-truck driver1 s4 truck5)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 2 of 9
13. (drive-truck driver1 s4 s3 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   goals met: 3 of 9
14. (disembark-truck driver1 s3 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s3) (empty truck5)
   goals met: 3 of 9
15. (unload-truck s6 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s6)
   goals met: 4 of 9
16. (walk driver3 p3-7 s3)
   deleted: (at driver3 p3-7)
   added: (at driver3 s3)
   goals met: 5 of 9
17. (drive-truck driver4 s6 s3 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   goals met: 4 of 9
18. (unload-truck s3 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s3)
   goals met: 5 of 9
19. (board-truck driver3 s3 truck2)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 4 of 9
20. (board-truck driver1 s3 truck4)
   deleted: (at driver1 s3) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 4 of 9
21. (drive-truck driver3 s3 s7 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   goals met: 5 of 9
22. (disembark-truck driver3 s7 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s7) (empty truck2)
   goals met: 5 of 9
23. (drive-truck driver1 s3 s7 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   goals met: 6 of 9
24. (walk driver3 s7 p3-7)
   deleted: (at driver3 s7)
   added: (at driver3 p3-7)
   goals met: 6 of 9
25. (board-truck driver5 s7 truck2)
   deleted: (at driver5 s7) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 6 of 9
26. (walk driver3 p3-7 s3)
   deleted: (at driver3 p3-7)
   added: (at driver3 s3)
   goals met: 7 of 9
27. (drive-truck driver5 s7 s5 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   goals met: 6 of 9
28. (disembark-truck driver5 s5 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s5) (empty truck2)
   goals met: 7 of 9
29. (board-truck driver2 s5 truck2)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 9
30. (drive-truck driver2 s5 s7 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   goals met: 8 of 9
31. (drive-truck driver4 s3 s6 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   goals met: 9 of 9
